In [1]:
import sqlite3
from sqlite3 import Error
import pandas as pd

In [2]:
conn = sqlite3.connect('tx_deathrow_full.db')

In [3]:
df = pd.read_csv('tx_deathrow_full.csv')
df.to_sql('tx_deathrow_full',conn,if_exists='fail')

C:\Users\19035\Anaconda3\envs\learn-env\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [4]:
cur=conn.cursor()

In [5]:
data = pd.DataFrame(cur.execute("""SELECT * FROM tx_deathrow_full""").fetchall())
data.columns = [x[0] for x in cur.description]

In [6]:
data.head()

,index,Execution,Date of Birth,Date of Offence,Highest Education Level,Last Name,First Name,TDCJ\nNumber,Age at Execution,Date Received,Execution Date,Race,County,Eye Color,Weight,Height,Native County,Native State,Last Statement
0,0,553,1983-09-24,2004-11-21,9.0,Young,Christopher Anthony,999508,34,2006-03-31,2018-07-17,Black,Bexar,Brown,216.0,"6' 1""",Bexar,Texas,l want to make sure the Patel family knows I l...
1,1,552,1951-08-28,1979-05-27,12.0,Bible,Danny Paul,999455,66,2003-07-17,2018-06-27,White,Harris,Blue,194.0,"5' 7""",Brazoria,Texas,None
2,2,551,1981-04-03,2003-12-03,10.0,Castillo,Juan Edward,999502,37,2005-09-27,2018-05-16,Hispanic,Bexar,Brown,180.0,"5' 11""",Bexar,Texas,To everyone that has been there for me you kno...
3,3,550,1987-04-04,2008-04-06,11.0,Davila,Erick Daniel,999545,31,2009-02-27,2018-04-25,Black,Tarrant,Brown,161.0,"5' 11""",Tarrant,Texas,"Yes, I would like to say nephew it burns huh. ..."
4,4,549,1980-03-26,2005-09-13,12.0,Rodriguez III,Rosendo,999534,38,2008-05-14,2018-03-27,Hispanic,Lubbock,Brown,198.0,"5' 8""",Wichita,Texas,First I would like to say I have been here sin...

In [7]:
def query(query):
    """
    Executes the sql query to output as pandas DataFrame
    ---------------------------------------
    Input:
    query (str): SQL query
    ---------------------------------------
    Output:
    pandas DataFrame
    """
    try:
        data = pd.DataFrame(cur.execute(query).fetchall())
        data.columns = [x[0] for x in cur.description]
    except:
        print('Cant Return Query')
    
    return data

In [8]:
def query_error(query):
    """
    Executes the sql query to output as pandas DataFrame
    ---------------------------------------
    Input:
    query (str): SQL query
    ---------------------------------------
    Output:
    pandas DataFrame
    """
    try:
        data = pd.DataFrame(cur.execute(query).fetchall())
        data.columns = [x[0] for x in cur.description]
    except:
        print('Cant Return Query')
    
    return data

In [9]:
def sql(query):
    return cur.execute(query)

In [10]:
sql("""ALTER TABLE tx_deathrow_full RENAME TO executions""")

In [11]:
sql("""ALTER TABLE executions RENAME 'First Name' TO first_name""")

In [12]:
sql("""ALTER TABLE executions RENAME 'Last Name' TO last_name""")
sql("""ALTER TABLE executions RENAME 'Execution' TO ex_number""")
sql("""ALTER TABLE executions RENAME 'Age at Execution' TO ex_age""")
sql("""ALTER TABLE executions RENAME 'Execution Date' TO ex_date""")
sql("""ALTER TABLE executions RENAME 'Last Statement' TO last_statement""")

In [13]:
query("""SELECT * FROM executions LIMIT 5""")

,index,ex_number,Date of Birth,Date of Offence,Highest Education Level,last_name,first_name,TDCJ\nNumber,ex_age,Date Received,ex_date,Race,County,Eye Color,Weight,Height,Native County,Native State,last_statement
0,0,553,1983-09-24,2004-11-21,9.0,Young,Christopher Anthony,999508,34,2006-03-31,2018-07-17,Black,Bexar,Brown,216.0,"6' 1""",Bexar,Texas,l want to make sure the Patel family knows I l...
1,1,552,1951-08-28,1979-05-27,12.0,Bible,Danny Paul,999455,66,2003-07-17,2018-06-27,White,Harris,Blue,194.0,"5' 7""",Brazoria,Texas,None
2,2,551,1981-04-03,2003-12-03,10.0,Castillo,Juan Edward,999502,37,2005-09-27,2018-05-16,Hispanic,Bexar,Brown,180.0,"5' 11""",Bexar,Texas,To everyone that has been there for me you kno...
3,3,550,1987-04-04,2008-04-06,11.0,Davila,Erick Daniel,999545,31,2009-02-27,2018-04-25,Black,Tarrant,Brown,161.0,"5' 11""",Tarrant,Texas,"Yes, I would like to say nephew it burns huh. ..."
4,4,549,1980-03-26,2005-09-13,12.0,Rodriguez III,Rosendo,999534,38,2008-05-14,2018-03-27,Hispanic,Lubbock,Brown,198.0,"5' 8""",Wichita,Texas,First I would like to say I have been here sin...

## The Beazley Case

Coments in SQL within: `/*.......*/`

In [14]:
# Arithematic Operations:

query("""SELECT 50+2,51*2""")

   50+2  51*2
0    52   102

In [15]:
query("""SELECT 51/2""")

   51/2
0    25

This gives out a round number since SQL does an **integer** division. **For the decimal point, 51.0/2.0**

In [16]:
query("""SELECT 51.0/2.0""")

   51.0/2.0
0      25.5

In [17]:
query("""SELECT first_name,last_name,ex_age FROM executions
WHERE ex_age <= 25""")

  first_name   last_name  ex_age
0    Toronto   Patterson      24
1       T.J.       Jones      25
2   Napoleon     Beazley      25
3    Richard     Andrade      25
4        Jay   Pinkerton      24
5      Jesse  De La Rosa      24

> The most powerful of these is probably `LIKE`. It allows us to use wildcards such as `%` and `_` to match various characters. For instance, `first_name LIKE '%roy'` will return true for rows with first names ‘roy’, ‘Troy’, and ‘Deroy’ but not ‘royman’. The wildcard `_` will match a single character so `first_name LIKE '_roy'` will only match ‘Troy’.

In [18]:
# Modify the query to find the result for Raymond Landry.
#You might think this would be easy since we already know his first and last name. 
#But datasets are rarely so clean. 
#Use the LIKE operator so you don't have to know his name perfectly to find the row.

query("""SELECT first_name, last_name, ex_number
FROM executions
WHERE first_name = 'Raymond'
  AND last_name = 'Landry'""")

Cant Return Query

Empty DataFrame
Columns: []
Index: []

In [19]:
query("""SELECT first_name, last_name, ex_number
FROM executions
WHERE first_name LIKE '%Raymond%'
  AND last_name LIKE '%Landry%'""")

  first_name    last_name  ex_number
0    Raymond  Landry, Sr.         29

> Quotes
In SQL, strings are denoted by single quotes. Backticks (ie `` can be used to denote column and table names. This is useful when the column or table name is the same as a SQL keyword and when they have a space in them. It's possible to have a database with a table named 'where' and a column named 'from'. (Who would be so cruel as to do this?!) You would have to do `SELECT ``from`` FROM ``where`` WHERE` .... This is another example why capitalization of SQL commands helps.

>As you’ve seen in the previous exercise, complex clauses can be made out of simple ones using Boolean operators like `NOT`, `AND` and `OR`. SQL gives most **precedence to NOT and then AND and finally OR**. But if, like me, you’re too lazy to remember the order of precedence, you can use parenthesis to clarify the order you want.

Quiz:

Correct answers:

`WHERE 0`

1 and 0 are the most basic Boolean statements. This block guarantees that no rows will be returned.

`WHERE ex_number < ex_age`

Multiple column names may be used in a clause.

`WHERE ex_age`

SQL can evaluate the truth-value of almost anything. The 'ex_age' column is filled with integers. The rule for integers is 0 is false and everything else is true, so only rows with non-zero ages will be returned.

In [20]:
# Napolean Beazley's last statement:

query("""SELECT last_statement FROM executions
WHERE first_name LIKE '%Napoleon%'
AND last_name LIKE '%Beazley%'""")

                                      last_statement
0  The act I committed to put me here was not jus...

In [21]:
beazly_statement = query("""SELECT last_statement FROM executions
WHERE first_name LIKE '%Napoleon%'
AND last_name LIKE '%Beazley%'""")

print(beazly_statement['last_statement'][0])

The act I committed to put me here was not just heinous, it was senseless. But the person that committed that act is no longer here - I am. I'm not going to struggle physically against any restraints. I'm not going to shout, use profanity or make idle threats. Understand though that I'm not only upset, but I'm saddened by what is happening here tonight. I'm not only saddened, but disappointed that a system that is supposed to protect and uphold what is just and right can be so much like me when I made the same shameful mistake. If someone tried to dispose of everyone here for participating in this killing, I'd scream a resounding, "No." I'd tell them to give them all the gift that they would not give me...and that's to give them all a second chance. I'm sorry that I am here. I'm sorry that you're all here. I'm sorry that John Luttig died. And I'm sorry that it was something in me that caused all of this to happen to begin with. Tonight we tell the world that there are no second chances in the eyes of justice...Tonight, we tell our children that in some instances, in some cases, killing is right. This conflict hurts us all, there are no SIDES. The people who support this proceeding think this is justice. The people that think that I should live think that is justice. As difficult as it may seem, this is a clash of ideals, with both parties committed to what they feel is right. But who's wrong if in the end we're all victims? In my heart, I have to believe that there is a peaceful compromise to our ideals. I don't mind if there are none for me, as long as there are for those who are yet to come. There are a lot of men like me on death row - good men - who fell to the same misguided emotions, but may not have recovered as I have. Give those men a chance to do what's right. Give them a chance to undo their wrongs. A lot of them want to fix the mess they started, but don't know how. The problem is not in that people aren't willing to help them find out, but in the system telling them it won't matter anyway. No one wins tonight. No one gets closure. No one walks away victorious.

## Claims of Innocence

In [22]:
query("""SELECT COUNT(first_name) FROM executions""")

   COUNT(first_name)
0                553

As you can tell, the COUNT function is intrinsically tied to the concept of NULLs.

In [23]:
#Find the total number of executions in the dataset.
#The idea here is to pick one of the columns that you're confident has no NULLs and count it.

query("""SELECT COUNT(ex_number) FROM executions""")

   COUNT(ex_number)
0               553

So far so good. But what if we don’t know which columns are NULL-free? Worse still, what if none of the columns are NULL-free? Surely there must still be a way to find the length of the table!

The solution is COUNT(*). This is reminiscent of SELECT * where the * represents all columns. In practice COUNT(*) counts rows as long as any one of their columns is non-null. This helps us find table lengths because a table shouldn’t have rows that are completely null.

In [24]:
query("""SELECT COUNT(*) FROM executions""")

   COUNT(*)
0       553

In [25]:
query("""SELECT
    SUM(CASE 
            WHEN county='Harris' THEN 1
            ELSE 0 
        END) AS execution_harris,
    SUM(CASE 
            WHEN county='Bexar' THEN 1
            ELSE 0 
        END) AS execution_bexar
FROM executions""")

   execution_harris  execution_bexar
0               128               46

In [26]:
query("""SELECT COUNT(ex_age) FROM executions WHERE ex_age > 50""")

   COUNT(ex_age)
0             68

In [27]:
query("""SELECT COUNT(*) FROM executions WHERE last_statement IS NULL""")

#OR
#SELECT COUNT(CASE WHEN last_statement IS NULL THEN 1 ELSE NULL END) FROM executions
#OR
#SELECT COUNT(*) - COUNT(last_statement) FROM executions

   COUNT(*)
0       110

It is worthwhile to step back and think about the different ways the computer handled these three queries. The WHERE version had it filter down to a small table first before aggregating while in the other two, it had to look through the full table. In the COUNT + CASE WHEN version, it only had to go through once, while the double COUNT version made it go through twice. So even though the output was identical, the performance was probably best in the first and worst in the third version.

In [28]:
query("""SELECT MIN(ex_age), MAX(ex_age), AVG(ex_age) FROM executions""")

   MIN(ex_age)  MAX(ex_age)  AVG(ex_age)
0           24           67    39.470163

In [29]:
#Find the average length (based on character count) of last statements in the dataset.
query("""SELECT AVG(LENGTH(last_statement)) FROM executions""")

   AVG(LENGTH(last_statement))
0                   537.492099

Sometimes, LEN() than LENGTH

>https://sqlite.org/index.html

>For lookups, I often use W3 Schools, Stack Overflow and the official SQLite documentation.

In [30]:
#List all the counties in the dataset without duplication.
#We can get unique entries by using SELECT DISTINCT. 

query("""SELECT DISTINCT(county) FROM executions""")

      County
0      Bexar
1     Harris
2    Tarrant
3    Lubbock
4     Dallas
..       ...
87   Kleberg
88  Hamilton
89     Milam
90  Chambers
91    Hardin

[92 rows x 1 columns]

In [31]:
#Find the proportion of inmates with claims of innocence in their last statements.
#To do decimal division, ensure that one of the numbers is a decimal by multiplying it by 1.0. 
#Use LIKE '%innocent%' to find claims of innocence.

query("""SELECT 1.0 * COUNT(CASE WHEN last_statement LIKE '%innocent%'
    THEN 1 ELSE NULL END) / COUNT(*)  AS fraction_innocent
FROM executions""")

   fraction_innocent
0           0.056058

In [32]:
query("""SELECT (SELECT COUNT(last_statement) FROM executions 
		WHERE last_statement LIKE '%innocent%')*1.0/
		(SELECT COUNT(*) FROM executions) AS fraction_innocent""")

   fraction_innocent
0           0.056058

## The Long Tail

In context of Texas executions, the long tail refers to a small number of counties which have been known to conduct a large number of executions.

Let’s find the percentage of executions from each county so that we can pick out the ones in the tail.

As will become increasingly evident, the shape of the tables tell us a lot about the operations we need to perform. (This is analogous to dimensional analysis in physics.)

### The GROUP BY Block

This is where the GROUP BY block comes in. It allows us to split up the dataset and apply aggregate functions within each group, resulting in one row per group. Its most basic form is `GROUP BY <column>, <column>, ...` and comes after the `WHERE` block.

In [33]:
query("""SELECT county, COUNT(*) as county_executions FROM executions GROUP BY county""")

        County  county_executions
0     Anderson                  4
1      Aransas                  1
2     Atascosa                  1
3       Bailey                  1
4      Bastrop                  1
..         ...                ...
87     Wharton                  1
88     Wichita                  2
89   Wilbarger                  2
90  Williamson                  3
91        Wood                  1

[92 rows x 2 columns]

In [34]:
query("""SELECT
  county,
  last_statement IS NOT NULL AS has_last_statement
FROM executions""")

        County  has_last_statement
0        Bexar                   1
1       Harris                   0
2        Bexar                   1
3      Tarrant                   1
4      Lubbock                   1
..         ...                 ...
548    Lubbock                   1
549       Bell                   1
550     Harris                   1
551  Jefferson                   0
552    Tarrant                   1

[553 rows x 2 columns]

In [35]:
query("""SELECT
  county,
  COUNT(last_statement IS NOT NULL) AS has_last_statement
FROM executions
GROUP BY county""")

        County  has_last_statement
0     Anderson                   4
1      Aransas                   1
2     Atascosa                   1
3       Bailey                   1
4      Bastrop                   1
..         ...                 ...
87     Wharton                   1
88     Wichita                   2
89   Wilbarger                   2
90  Williamson                   3
91        Wood                   1

[92 rows x 2 columns]

In [36]:
query("""SELECT
  county,
  last_statement IS NOT NULL AS has_last_statement,
  COUNT(*)
FROM executions
GROUP BY county, has_last_statement""")

         County  has_last_statement  COUNT(*)
0      Anderson                   1         4
1       Aransas                   1         1
2      Atascosa                   1         1
3        Bailey                   1         1
4       Bastrop                   1         1
..          ...                 ...       ...
114     Wharton                   0         1
115     Wichita                   1         2
116   Wilbarger                   0         2
117  Williamson                   1         3
118        Wood                   1         1

[119 rows x 3 columns]

In [37]:
query("""SELECT county, COUNT(*) FROM executions WHERE ex_age>=50
GROUP BY county""")

         County  COUNT(*)
0      Anderson         1
1         Bexar         2
2      Caldwell         1
3       Cameron         1
4        Collin         2
5         Comal         1
6        Dallas        11
7     Galveston         2
8       Grayson         1
9         Gregg         2
10       Harris        21
11    Henderson         1
12      Houston         1
13    Jefferson         2
14      Johnson         1
15        Lamar         2
16          Lee         1
17      Lubbock         3
18     McLennan         1
19   Montgomery         5
20      Navarro         1
21       Newton         1
22        Pecos         1
23       Potter         1
24  San Jacinto         1
25        Smith         2
26      Tarrant         4
27       Travis         1
28       Upshur         1
29       Walker         1
30      Wichita         1
31         Wood         1

### HAVING

Clause on the Group BY or aggregate function.

In [38]:
query("""SELECT county FROM executions WHERE ex_age>=50
GROUP BY county
HAVING COUNT(*)>2""")

       County
0      Dallas
1      Harris
2     Lubbock
3  Montgomery
4     Tarrant

In [39]:
query("""SELECT
  county,
  ex_age/10 AS decade_age,
  COUNT(*)
FROM executions
GROUP BY county, decade_age""")

         County  decade_age  COUNT(*)
0      Anderson           3         2
1      Anderson           4         1
2      Anderson           5         1
3       Aransas           4         1
4      Atascosa           4         1
..          ...         ...       ...
171     Wichita           5         1
172   Wilbarger           4         2
173  Williamson           3         1
174  Williamson           4         2
175        Wood           5         1

[176 rows x 3 columns]

In [40]:
#List all the distinct counties in the dataset.
#We did this in the previous chapter using the SELECT DISTINCT command. 
#This time, stick with vanilla SELECT and use GROUP BY.

query("""SELECT county FROM executions GROUP BY county""")

        County
0     Anderson
1      Aransas
2     Atascosa
3       Bailey
4      Bastrop
..         ...
87     Wharton
88     Wichita
89   Wilbarger
90  Williamson
91        Wood

[92 rows x 1 columns]

### Nested Queries

In [41]:
#Find the first and last name of the inmate with the longest last statement (by character count).

query("""SELECT first_name, last_name
FROM executions
WHERE LENGTH(last_statement) =
    (SELECT MAX(LENGTH(last_statement)) FROM executions)""")

  first_name last_name
0       Gary    Graham

In [42]:
query("""SELECT
  county,
  100.0 * COUNT(*) / (SELECT COUNT(*) FROM executions)
    AS percentage
FROM executions
GROUP BY county
ORDER BY percentage DESC""")

      County  percentage
0     Harris   23.146474
1     Dallas   10.488246
2      Bexar    8.318264
3    Tarrant    7.414105
4     Nueces    2.893309
..       ...         ...
87     Brown    0.180832
88   Bastrop    0.180832
89    Bailey    0.180832
90  Atascosa    0.180832
91   Aransas    0.180832

[92 rows x 2 columns]

Is it surprising that Harris (home to the city of Houston), Dallas, Bexar and Tarrant account for about 50% of all executions in Texas? Perhaps it is, especially if we start from the assumption that executions should be distributed evenly across counties. But a better first approximation is that executions are distributed in line with the population distribution. The 2010 Texas Census shows that the 4 counties had a population of 10.0M which is 40.0% the population of Texas (25.1M). This makes the finding slightly less surprising.

But breaking this tail down further, we realize that Harris county accounts for most of the delta. It only has 16.4% of the population, but 23.1% of the executions. That’s almost 50% more than it’s supposed to have.

Numerous studies have examined why Harris county has been so prolific and several factors have been suggested:

Prosecutions have been organized and well-financed, while defenses have been court-financed and poorly-incentivized. (Source, see p49)

The long-time district attorney was determined and enthusiastic about the death penalty.

Judges in Texas are elected, and the population has supported the death penalty. (Source)

Checks and balances in the Harris county judicial system have not worked. (Source, see p929)

### Summary

**MapReduce**

>An interesting addendum is that we've actually just learned to do MapReduce in SQL. MapReduce is a famous programming paradigm which views computations as occuring in a "map" and "reduce" step. You can learn more about MapReduce here.

>The Beazley chapter was all about mapping because it showed us how to map various operations out to all the rows. For example, SELECT LENGTH(last_statement) FROM executions maps the length function out to all the rows. This chapter showed us how to reduce various groups of data using aggregation functions; and the previous Claims of Innocence chapter was just a special case in which the entire table is one group.

## Execution Hiatuses

### Hiatuses

There have been several extended periods when no executions took place. Our goal is to figure out exactly when they were and research their causes.

Our strategy is to get the table into a state where each row also contains the date of the execution before it. We can then find the time difference between the two dates, order them in descending order, and read off the longest hiatuses.

### DATES

SQLite supports five date and time functions as follows:

date(time-value, modifier, modifier, ...)
time(time-value, modifier, modifier, ...)
datetime(time-value, modifier, modifier, ...)
julianday(time-value, modifier, modifier, ...)
strftime(format, time-value, modifier, modifier, ...)
All five date and time functions take a time value as an argument. The time value is followed by zero or more modifiers. The strftime() function also takes a format string as its first argument.

The date and time functions use a subset of IS0-8601 date and time formats. The date() function returns the date in this format: YYYY-MM-DD. The time() function returns the time as HH:MM:SS. The datetime() function returns "YYYY-MM-DD HH:MM:SS". The julianday() function returns the Julian day - the number of days since noon in Greenwich on November 24, 4714 B.C. (Proleptic Gregorian calendar). The strftime() routine returns the date formatted according to the format string specified as the first argument. The format string supports the most common substitutions found in the strftime() function from the standard C library plus two new substitutions, %f and %J. The following is a complete list of valid strftime() substitutions:

%d		day of month: 00
%f		fractional seconds: SS.SSS
%H		hour: 00-24
%j		day of year: 001-366
%J		Julian day number
%m		month: 01-12
%M		minute: 00-59
%s		seconds since 1970-01-01
%S		seconds: 00-59
%w		day of week 0-6 with Sunday==0
%W		week of year: 00-53
%Y		year: 0000-9999
%%		%
Notice that all other date and time functions can be expressed in terms of strftime():

Function		Equivalent strftime()
date(...)		strftime('%Y-%m-%d', ...)
time(...)		strftime('%H:%M:%S', ...)
datetime(...)		strftime('%Y-%m-%d %H:%M:%S', ...)
julianday(...)		strftime('%J', ...)
The only reasons for providing functions other than strftime() is for convenience and for efficiency.

>https://www.sqlite.org/lang_datefunc.html

In [43]:
query("""SELECT JULIANDAY('1993-08-10') - JULIANDAY('1989-07-07') AS day_difference""")

   day_difference
0          1495.0

### Self Joins

Let’s suppose the additional information we want exists in a table called previous which has two columns (ex_number, last_ex_date).

The next step is to build out the previous table.

In [44]:
#Write a query to produce the previous table.
#Remember to use aliases to form the column names(ex_number, last_ex_date). 
#Hint: Instead of shifting dates back, you could shift ex_number forward!

query("""SELECT
  ex_number + 1 AS ex_number,
  ex_date AS last_ex_date
FROM executions
WHERE ex_number < 553""")

     ex_number last_ex_date
0          553   2018-06-27
1          552   2018-05-16
2          551   2018-04-25
3          550   2018-03-27
4          549   2018-02-01
..         ...          ...
547          6   1985-01-16
548          5   1984-10-30
549          4   1984-03-31
550          3   1984-03-14
551          2   1982-12-07

[552 rows x 2 columns]

In [45]:
#Nest the query which generates the previous table into the template.
#Notice that we are using a table alias here, naming the result of the nested query "previous".

query("""SELECT last_ex_date as start,
                ex_date as end,
                JULIANDAY(ex_date)-JULIANDAY(last_ex_date) AS day_difference
                FROM executions
                JOIN(SELECT ex_number +1 as ex_number,
                            ex_date AS last_ex_date
                     FROM executions) previous
                ON executions.ex_number = previous.ex_number""")

query("""SELECT
  last_ex_date AS start,
  ex_date AS end,
  JULIANDAY(ex_date) - JULIANDAY(last_ex_date) AS day_difference
FROM executions
JOIN (
    SELECT
      ex_number + 1 AS ex_number,
      ex_date AS last_ex_date
    FROM executions
  ) previous
  ON executions.ex_number = previous.ex_number
ORDER BY day_difference DESC
LIMIT 10""")

        start         end  day_difference
0  1982-12-07  1984-03-14           463.0
1  1988-01-07  1988-11-03           301.0
2  2007-09-25  2008-06-11           260.0
3  1990-07-18  1991-02-26           223.0
4  1984-03-31  1984-10-30           213.0
5  1996-02-27  1996-09-18           204.0
6  2016-04-06  2016-10-05           182.0
7  1985-09-11  1986-03-12           182.0
8  2014-04-16  2014-09-10           147.0
9  1996-09-18  1997-02-10           145.0

In [46]:
query("""SELECT
  last_ex_date AS start,
  ex_date AS end,
  JULIANDAY(ex_date) - JULIANDAY(last_ex_date) AS day_difference
FROM executions
JOIN (
    SELECT
      ex_number + 1 AS ex_number,
      ex_date AS last_ex_date
    FROM executions
  ) AS previous
  ON executions.ex_number = previous.ex_number
ORDER BY day_difference DESC
LIMIT 10""")

        start         end  day_difference
0  1982-12-07  1984-03-14           463.0
1  1988-01-07  1988-11-03           301.0
2  2007-09-25  2008-06-11           260.0
3  1990-07-18  1991-02-26           223.0
4  1984-03-31  1984-10-30           213.0
5  1996-02-27  1996-09-18           204.0
6  2016-04-06  2016-10-05           182.0
7  1985-09-11  1986-03-12           182.0
8  2014-04-16  2014-09-10           147.0
9  1996-09-18  1997-02-10           145.0

BETTER WAY BY **SELF JOINS**

In [47]:
query("""SELECT
  previous.ex_date AS start,
  executions.ex_date AS end,
  JULIANDAY(executions.ex_date) - JULIANDAY(previous.ex_date)
    AS day_difference
FROM executions
JOIN executions previous
  ON executions.ex_number = previous.ex_number+1
ORDER BY day_difference DESC
LIMIT 10""")

        start         end  day_difference
0  1982-12-07  1984-03-14           463.0
1  1988-01-07  1988-11-03           301.0
2  2007-09-25  2008-06-11           260.0
3  1990-07-18  1991-02-26           223.0
4  1984-03-31  1984-10-30           213.0
5  1996-02-27  1996-09-18           204.0
6  2016-04-06  2016-10-05           182.0
7  1985-09-11  1986-03-12           182.0
8  2014-04-16  2014-09-10           147.0
9  1996-09-18  1997-02-10           145.0

## Closing Remarks and Challenge Questions

### Senate Cosponsorship Dataset

https://selectstarsql.com/questions.html

The senator who introduces the bill is called the “sponsor”. Other senators can show their support by cosponsoring the bill. Cosponsors at the time of introduction are called “original cosponsors” (Source). Each row of the table shows the bill, the sponsor, an original cosponsor, and the states the senators represent. Note that there can be multiple cosponsors of a bill.

**Find the most networked senator. That is, the one with the most mutual cosponsorships.**
A mutual cosponsorship refers to two senators who have each cosponsored a bill sponsored by the other. Even if a pair of senators have cooperated on many bills, the relationship still counts as one.

```
WITH mutuals AS (
  SELECT DISTINCT
    c1.sponsor_name AS senator,
    c2.sponsor_name AS senator2
  FROM cosponsors c1
  JOIN cosponsors c2
    ON c1.sponsor_name = c2.cosponsor_name
    AND c2.sponsor_name = c1.cosponsor_name
)

SELECT senator, COUNT(*) AS mutual_count
FROM mutuals
GROUP BY senator
ORDER BY mutual_count DESC
LIMIT 1 
```

**Now find the most networked senator from each state.**
If multiple senators tie for top, show both. Return columns corresponding to state, senator and mutual cosponsorship count.

```
WITH mutual_counts AS (
  SELECT
    senator, state, COUNT(*) AS mutual_count
  FROM (
    SELECT DISTINCT
      c1.sponsor_name AS senator,
      c1.sponsor_state AS state,
      c2.sponsor_name AS senator2
    FROM cosponsors c1
    JOIN cosponsors c2
      ON c1.sponsor_name = c2.cosponsor_name
      AND c2.sponsor_name = c1.cosponsor_name
    )
  GROUP BY senator, state
),

state_max AS (
  SELECT
    state,
    MAX(mutual_count) AS max_mutual_count
  FROM mutual_counts
  GROUP BY state
)

SELECT
  mutual_counts.state,
  mutual_counts.senator,
  mutual_counts.mutual_count
FROM mutual_counts
JOIN state_max
  ON mutual_counts.state = state_max.state
  AND mutual_counts.mutual_count = state_max.max_mutual_count
```

**Find the senators who cosponsored but didn't sponsor bills.**

```
SELECT DISTINCT c1.cosponsor_name
FROM cosponsors c1
LEFT JOIN cosponsors c2
 ON c1.cosponsor_name = c2.sponsor_name
 -- This join identifies cosponsors
 -- who have sponsored bills
WHERE c2.sponsor_name IS NULL
-- LEFT JOIN + NULL is a standard trick for excluding
-- rows. It's more efficient than WHERE ... NOT IN.
```